["RT @Omojuwa: Fire outbreak Oando petrol station welder working damaged reservior","RT @ncheta_ewuzie: @Papadonkee @HenshawKate @Twitter good intention","doubt will offend senses believe intention behind posting it..","RT @Omojuwa: Manchester United send condolence Nigerian fans died watching match","RT @Omojuwa: PDP Crisis: Jonathan’s committee relevance – Sheriff’s faction","&gt;Erotic Story: husband's revenge - began gyrate hips wet pussy hard dick","RT @Omojuwa: Academic grinds halt ASUP LASPOTECH commences indefinite strike today","Married man sends hijack hoax email avoid trip online girlfriend","RT @ncheta_ewuzie: @Papadonkee @HenshawKate @Twitter will delete video stupid point child pornography.…","Harrysong Marries One-Eyed Lover? - Desmond Chima-Ike question practically dominated entire cy...","UBA’s REDTV sponsors Runway Jazz commemorate Lagos @ 50 - Desmond Ike-Chima REDTV dynamic online lifest...","Assault case latest: Court awards N2 Million damages musician Lynxx","&gt;Wanted South-Africa based Nigerian Pastor sex 30 young Girls, arrested (See video Arrest)","*Finally!! Tboss Reacts AY Kemen Issue (VIDEO)","RT @eniewealth: Parent shld teach kids sex education child start talking.Parent shld aware sin let u chi…","RT @CDL24hrsLoan: Loans R us.... right comes loans. #Who50kdonEpp","RT @CDL24hrsLoan: give loans gainfully employed individuals private public sector. #Who50kdonEpp","RT @CDL24hrsLoan: offer loans 2 serving corps members start new business. buy commercial lifestyle assets get new certif…","RT @CDL24hrsLoan: Good know RT @TrendsNigeria: CREDIT DIRECT LTD, @cdl24hrsloan now trending Nigeria\n\n http…","RT @CDL24hrsLoan: Dear @gcudmaster sure can... employed please call 070creditdirect send email Cashtogo@creditdirec…","RT @NigerianHleb: Lmao Kante played park Fellaini &amp; Ander Herrera Chelsea fans wanna tell he's Modric/…","NDDC gives additional two weeks ultimatum return site  via @todayng","RT @OmoGbajaBiamila: Governor Ahmed Kwara State Appoints Two New Special Assistants","Assault case latest: Court awards N2 Million damages musician Lynxx  @vanguardngr.com","scientists joining March Science","UBA’s REDTV sponsors Runway Jazz commemorate Lagos @ 50  @vanguardngr.com","ARG, Aregbesola mourn Famakinwa","Windows Central Podcast #46 going live! Join us","RT @Omojuwa: @CDL24hrsLoan Thank time. useful information. can take time engage questions prospective…","Missed #MSDataAmp? Re-watch live event keynote on-demand now:","WATCH: Gambia’s race save Kunta Kinteh island","Missed #MSDataAmp? Re-watch live event keynote on-demand now:","Can control manage server remotely—or mobile device? can #WinServ 2016. Learn it:…","RT @CDL24hrsLoan: #Who50kDonEpp?\n#Who50kDonEpp?\n#Who50kDonEpp?\n#Who50kDonEpp?","RT @CDL24hrsLoan: #who50kdonEpp?\n#who50kdonEpp?\n#who50kdonEpp?\n#who50kdonEpp?\n#who50kdonEpp?\n@Omojuwa"]