["30 Manchester United fans electrocuted Calabar  - via @sitibedotcom","EFCC traces N2bn Niger’s former commissioner","Buhari expresses shock death Calabar football fans","Buhari chronically ill – Perry Brimah","EFCC Uncovers Fresh N2billion Bank Account  via @OsunDefender","+Erotic Story: taxi game - \"Fuck me, harder, fuck pussy\" Seduced female Passenger","Arkansas executes death row inmate Ledell Lee, first execution state since 2005","Educator calls uniform cut-off mark JAMB admission","Sri Lankan President threatens jail anti-garbage protesters","!Man gets stuck inside best friend's wife sex back (Photos/Video)","#Etisalat #EasterHangout. cherish time spent @BadmusEniola, @fishentertainer &amp; customers.…","NP: Carry go - @IAM2SHOTZ #LunchBoxOldies cc @DJSMOOTHNIGERIA","Spain guaranteed yet another final place. Juventus Monaco will battle.","Ugo Ehiogu, former England defender suffered cardiac arrest - Nation Nigeria","Buhari urges Nigerians keep faith `Change Begins Me’ mantra  via @todayng","(Model puts Drake blast getting pregnant refusing pick calls (See Screenshots Chats)","Checkout Latest agbada designs ladies (Photos) -","Man faces fraud charge - Nation Nigeria","RT @Omojuwa: Real Madrid v Atletico Madrid III","NP: E dey pain - Stereoman #LunchBoxOldies cc @DJSMOOTHNIGERIA","EFCC traces N2bn Niger’s former commissioner","\"Chairman Chanchangi Airline Laid Rest","RT @YNaija: 'There's much beautiful things Africa thats I'm trying music' - @wizkidayo Channel 4","Vincent Aboubakar closes door FC Porto return  via @todayng","PRESS RELEASE \n\nCalabar Viewing Centre Tragedy: Ndoma-Egba Mourns Victims Chairman Governing Board of...","!Checkout interesting facts 16 year old Nollywood Actress Regina Daniels (Photos)","NOUN names research centre ex-President Obasanjo  via @todayng","NP: Soji - Rasqie #LunchBoxOldies cc @DJSMOOTHNIGERIA","BREAKING: DAWN Commission Director General, Dipo Famakinwa, dead","two men held opposing views war, also made","#Etisalat #EasterHangout. cherish time spent @pearlcardy customers. Check hig…","Calabar viewing centre electrocution tragedy occurred - Nation Nigeria","RT @SUgbor: save $15m fa. Imagine much we'd save buy closing just one chamber @nassnigeria. @MBuhari @bukolasaraki @Yaku…","RT @Mr_Charlze: need get rid France want truly independent...+","+Erotic Story: husband's revenge - began gyrate hips wet pussy hard dick","PRESIDENT BUHARI SADDENED TRAGIC DEATH FOOTBALL FANS CALABAR\n\nPresident Muhammadu Buhari shocked and...","UPDATE: SUNNY ELIJAH DEFECTS PDP AKWA IBOM APC TOMORROW \n\nTomorrow Saturday, 22nd April, roads..."]